/*==============================================================================

	シーン画面[scene.h]
	Author :20106_田中蓮
	Date   :23_07_06
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum SCENE {
	SCENE_NONE,		//動作シーンなし

	SCENE_TITLE,	//タイトル画面
	SCENE_GAME,		//ゲーム画面
	SCENE_RESULT,	//リザルト画面

	SCENE_NUM,
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitScene(void);
void UninitScene(void);
void UpdateScene(void);
void DrawScene(void);

void SetScene(SCENE next_scene);
void CheckScene(void);