/*==============================================================================

	頂点管理 [second.cpp]
	Author :20106_田中蓮
	Date   :23_09_21
--------------------------------------------------------------------------------

==============================================================================*/
#include "second.h"
#include "sprite.h"
#include "texture.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUM_POLYGON 100	//表示するポリゴンの数

#define ANIME_PTN_YOKO 10
#define ANIME_PTN_TATE 1
#define ANIME_PTN_WAIT 5

#define ANIME_PTN (ANIME_PTN_YOKO * ANIME_PTN_TATE)
#define ANIME_PTN_U (1.0f / ANIME_PTN_YOKO)
#define ANIME_PTN_V (1.0f / ANIME_PTN_TATE)
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
static int g_TexNo;
static float g_U;		//U値の横幅
static float g_V;		//V値の高さ

static unsigned int g_Second = 0;
static unsigned int g_StartTime = 0;
static unsigned int g_ClearTime = 0;

//=============================================================================
// 初期化処理
//=============================================================================
void InitSecond(void)
{
	//テクスチャの読み込み
	g_TexNo = LoadTexture((char*)"data/TEXTURE/number000.png");

	g_U = 0.0f;
	g_V = 0.0f;

	//ゲームの開始時刻を保存する
	g_StartTime = timeGetTime();
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitSecond(void)
{
	g_ClearTime = g_Second;
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateSecond(void)
{
	//経過した秒数を更新する
	g_Second = (timeGetTime() - g_StartTime) / 1000;
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawSecond(void)
{
	int second = g_Second;

	//時間表示
	for (int i = 0; i < 3; i++)
	{
		//スコアの描画
		DrawSpriteColor(g_TexNo,
			1850.0f - (50.0f * i), 60.0f,
			50.0f, 100.0f,
			ANIME_PTN_U * (second % 10), 0.0f,//UV値の始点
			ANIME_PTN_U, ANIME_PTN_V,
			1.0f, 1.0f, 1.0f, 1.0f);

		second = second / 10;
	}
}

int GetClearTime(void) {
	return g_ClearTime;
}