/*==============================================================================

	タイトル画面管理 [title.cpp]
	Author :20106_田中蓮
	Date   :23_06_30
--------------------------------------------------------------------------------

==============================================================================*/
#include "title.h"
#include "input.h"
#include "sprite.h"
#include "texture.h"
#include "scene.h"
#include "fade.h"
#include "pushspace.h"

#include "sound.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
static int			g_TexNo = 0;
static int			g_SoundNo = 0;

//=============================================================================
// 初期化処理
//=============================================================================
void InitTitle(void)
{
	//テクスチャの読み込み
	g_TexNo = LoadTexture((char*)"data/TEXTURE/title00.png");

	g_SoundNo = LoadSound((char*)"data/sound/bgm_title.wav");
	SetVolume(g_SoundNo, 0.2f);
	PlaySound(g_SoundNo, -1);

	InitPushspace();
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitTitle(void)
{
	UninitPushspace();
	StopSound(g_SoundNo);
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateTitle(void)
{
	UpdatePushspace();
	//キーボード
	if (GetKeyboardTrigger(DIK_SPACE) ||
		IsButtonTriggered(0, BUTTON_A))
	{
		//現在フェード中でないなら
		if (GetFadeState() == SCENE_NONE) {
			SetFadeColor(0.0f, 0.0f, 0.0f);
			//シーンの切り替えを行う
			//ゲームシーン遷移
			SceneTransition(SCENE_GAME);
		}
		//ゲームシーン遷移
		//SetScene(SCENE_GAME);
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawTitle(void)
{
	//タイトルの描画
	DrawSpriteLeftTop(g_TexNo,
		0.0f, 0.0f,
		SCREEN_WIDTH, SCREEN_HEIGHT,
		0.0f, 0.0f,//UV値の始点
		1.0f, 1.0f);
	DrawPushspace();
}
